# -*- coding:utf-8 -*-
# @Time    : 10/19/23 4:14 PM
# @Author  : wlj




problem = [
    '''已知：□＋□＋○＋○=14     □＋□＋○=11     求：□=       ○=     ''',
    '''一本书共100页，从前面数第30页是一幅漂亮的插图，如果倒过来数这张插图是第（     ）页。''',
    '''20只小动物排一排，从左往右数第16只是小兔，从右往左数第10只是小鹿，求从小鹿数到小兔，一共有（      ）只小动物。''',
    '''军军今年6岁，妈妈的年龄是军军的5倍，4前年妈妈比军军大（      ）岁。''',
    '''一串珠子，按下图这样排列，那么第32颗是（    ）颜色，第44颗是（    ）颜色。
———○—○—○—●—●—○—○—○—●—●—○—○—……''',
    '''甲笼里有28只兔，乙笼里有6只，怎样调整才能使两笼兔子的只数同样多？(兔子总数不变)''',
    '''甲筐里有15个瓜，乙筐里有27个瓜，爷爷又摘回20个瓜放进这两个筐，怎样放才能使两筐瓜的个数同样多？''',
    '''18个人吃饭，每人一个饭碗，2人一个菜碗，3人一个汤碗，一共需要(     )个碗。''',
    '''小朋友吃饭，每人一个饭碗，2人一个菜碗，3人一个汤碗，一共需要11个碗请你算一算，吃饭的一共有（      ）人。''',
    '''蓉蓉中的这幢楼共七层，每层楼梯20级，她家住五楼你知道蓉蓉走（    ）级楼梯才能到自己住的那一层。''',
    '''找规律填数
（1）1、2、4、5、7、8、10、(    )、(    )
（2）1、3、6、（     ）、（     ）
（3）35，( 　)，21，14，(    )，( 　)。''',
    '''小红上午7：30到校，中午11：30放学，下午1：30到校，3：30离校，小红一天在校(     )小时。''',
    '''一串珠子，按下图这样排列，那么第32颗是什么颜色，第44颗呢?  
---○-○-○-●-●-○-○-○-●-●-○-○-……''',
    '''小猴子早上吃2个桃子1个香蕉，中午吃2个香蕉1个桃子，晚上吃1个桃子1个香蕉，则一星期(7天)小猴子要吃多少个桃子?多少个香蕉?''',
    '''一杯纯牛奶，小强先喝了半杯，然后加满凉开水，又喝了半杯，再加满凉开水，最后全部喝完，问小强喝的牛奶多，还是凉开水多，还是两者一样多?  ''',
    '''淘气有300元钱，买书用去56元，买文具用去128元，淘气剩下的钱比原来少多少元?  ''',
    '''将15分拆成不大于9的四个不同的自然数之和，有多少种不同的分拆方式，请一一列出.''',
    '''学校第一次买5个篮球和6个足球用了1000元，第二次买了同样的5个篮球和9个足球，用了1300元，足球每个多少钱?  ''',
    '''林林、红红、芳芳三个小朋友买蛋糕吃。林林买了7块，红红买了8块，芳芳没有买。三个小朋友要平分吃，芳芳一共付了15元钱，其中给林林(   )元，给红红(  )元。''',
    '''二(1)班小朋友排成长方形队伍参加体操表演。阿宝左看是第6名，右看是第2名，前看是第4名，后看是第3名。二(1)班共有(  )小朋友。''',
    '''像“101”这个三位数，它的个位数字与百位数字调换以后，数的大小并不改变，问从100至200之间有多少个这样的三位数？''',
    '''A＋A＋B＋B＋C＝25    A＋B＝10        C=( )''',
    '''将20根绳子打结连接成一根长绳，要打（  ）个结。''',
    '''10名男同学拉成一圈做游戏，每两名男同学之间插入一名女同学。现在一共有（ ）名同学在做游戏。''',
    '''明明今年8岁，2年后他与妈妈的年龄共45岁。妈妈今年多少岁？''',
    '''把一块豆腐切3刀，最多可以切出（  ）小块。''',
    '''5只鸡和5只兔子一共（     ）条腿。''',
    '''甲、乙两筐西瓜共28个，从甲筐取3个放入乙筐，两筐西瓜个数相同。原来乙筐中有多少个西瓜？''',
    '''有10只小动物排队，从左往右数，小兔子在第4位，从右往左数，小兔子在第几位呢？''',
    '''有一群小动物在排队，从前往后数，小鸭子排第8，从后往前数，小鸭子排第5，队伍里一共有多少只小动物？''',
    '''有23只小动物排队，小猴子的前面有15只小动物，请问小猴子的后面有几只小动物？''',
    '''找规律：
(1) 1，2，_____,_____, 11, 16, 22, _____, _____, 37, 46
(2) 1, 4, 7, _____, _____, 16, _____, 22, 25
(3) 1, 1, 2, 3, _____, 8, _____, 21, 34, _____, 89''',
    '''小华和小刚每人有15张画，小华给小刚5张后，小刚比小华多几张？''',

]
